In [16]:
import pandas as pd
import numpy as np

In [17]:
df=pd.read_csv('London_housing_data.csv')
df

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN
...,...,...,...,...,...,...
13544,9/1/2019,england,249942,E92000001,64605.0,NaN
13545,10/1/2019,england,249376,E92000001,68677.0,NaN
13546,11/1/2019,england,248515,E92000001,67814.0,NaN
13547,12/1/2019,england,250410,E92000001,NaN,NaN
13548,1/1/2020,england,247355,E92000001,NaN,NaN

 The data is primarily centered around  the housing market of london. It contains a lot of additional relevant data.
-- Monthly average house prices
-- Yearly number of houses sold
-- Monthly number of crimes committed

The data used here is from year 1995 to 2019 of each different area

In [18]:
df.shape

(13549, 6)

In [19]:
df.isnull().sum()   #counting the number of missing values.....

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

In [20]:
df.count()     #non-missing values in the data......

date             13549
area             13549
average_price    13549
code             13549
houses_sold      13455
no_of_crimes      7439
dtype: int64

# Convert the datatype of 'Date' column to date-time format

In [21]:
df.dtypes

date              object
area              object
average_price      int64
code              object
houses_sold      float64
no_of_crimes     float64
dtype: object

In [22]:
df['date'] = pd.to_datetime(df['date'])
df.dtypes

date             datetime64[ns]
area                     object
average_price             int64
code                     object
houses_sold             float64
no_of_crimes            float64
dtype: object

# Add a new column 'year' in the dataframe which contains year only

In [23]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN
1,1995-02-01,city of london,82203,E09000001,7.0,NaN

In [24]:
# ---> Ist Method works only if datatype is object......

# df['year']=df['date'].apply(lambda x: x.split('-')[0])

In [33]:
import datetime
df['year']=df['date'].dt.year
df.head(2)

,date,month,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,1,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,2,city of london,82203,E09000001,7.0,NaN,1995

# Add a new column 'month' in the dataframe which contains month year only

In [41]:
import datetime
df['month']=df['date'].dt.month
df.head(2)

,date,month,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,1,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,2,city of london,82203,E09000001,7.0,NaN,1995

# Remove the 'month' and 'year' from the dataframe.

In [43]:
df.drop(columns=['month','year'],inplace=True)
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN
1,1995-02-01,city of london,82203,E09000001,7.0,NaN

# Show all the records where 'No. of crimes' is 0. And how many records are there?

In [46]:
df[df['no_of_crimes'] == 0]

,date,area,average_price,code,houses_sold,no_of_crimes
72,2001-01-01,city of london,284262,E09000001,24.0,0.0
73,2001-02-01,city of london,198137,E09000001,37.0,0.0
74,2001-03-01,city of london,189033,E09000001,44.0,0.0
75,2001-04-01,city of london,205494,E09000001,38.0,0.0
76,2001-05-01,city of london,223459,E09000001,30.0,0.0
...,...,...,...,...,...,...
178,2009-11-01,city of london,397909,E09000001,11.0,0.0
179,2009-12-01,city of london,411955,E09000001,16.0,0.0
180,2010-01-01,city of london,464436,E09000001,20.0,0.0
181,2010-02-01,city of london,490525,E09000001,9.0,0.0
182,2010-03-01,city of london,498241,E09000001,15.0,0.0

In [54]:
len(df[df['no_of_crimes'] == 0])

104

# What is the maximum and minimum 'average_price' per year in england?

In [64]:
df.groupby('area')

KeyError: False

In [62]:
df['area']

0        city of london
1        city of london
2        city of london
3        city of london
4        city of london
              ...
13544           england
13545           england
13546           england
13547           england
13548           england
Name: area, Length: 13549, dtype: object